LSTMClassifier(
  (lstm): LSTM(36, 128, batch_first=True)
  (norm): LayerNorm((128,), eps=1e-05, elementwise_affine=True)
  (head): Sequential(
    (0): Linear(in_features=128, out_features=128, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.1, inplace=False)
    (3): Linear(in_features=128, out_features=2, bias=True)
  )
)

Params: 102018